Revit 2024 API
ParameterTypeId.StructConnectionApplyTo Property
 "Apply to"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructConnectionApplyTo { get; }
Visual Basic
Public Shared ReadOnly Property StructConnectionApplyTo As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructConnectionApplyTo {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace